const express = require('express')
const router = express.Router()
const mongoClient = require('mongodb').MongoClient
const dbURL = 'mongodb://localhost:27017'


function responseAction(collectionName,query,req, res, skipnum,limitnum) {
	
	if (typeof(skipnum) != 'number') {
		res.send("请输入整数page")
		res.end()
		return
	}

	if (typeof(limitnum) != 'number') {
		res.send("请输入整数limitnum")
		res.end()
	}

	
	mongoClient.connect(dbURL, {useNewUrlParser:true},function(error, db){
		const books = db.db('books')
		const sentences = books.collection(collectionName)

		sentences.find(query).skip(skipnum * limitnum).limit(limitnum).toArray(function (error, docs){
			res.send(docs)
			res.end()
			db.close()
		})
	})
}


/**
 * @api {get} /poems/:page 古诗分页列表
 * @apiSampleRequest http://180.76.181.15:3000/poems/:page
 * @apiDescription 古诗分页列表
 * @apiName 古诗分页列表
 * @apiGroup Poems
 * @apiParam {Int} page 页数
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf471f",
 *         "poem_id": "5e26797704a7",
 *         "poem_content": "  人间四月芳菲尽，山寺桃花始盛开。 /n  长恨春归无觅处，不知转入此中来。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "1994",
 *                 "extension_content": "译文/n在人间四月里百花凋零已尽，高山古寺中的桃花才刚刚盛开。/n我常为春光逝去无处寻觅而怅恨，却不知它已经转到这里来。/n注释/n大林寺：在庐山大林峰，相传为晋代僧人昙诜所建，为中国佛教胜地之一。/n人间：指庐山下的平地村落。芳菲：盛开的花，亦可泛指花，花草艳盛的阳春景色。尽：指花凋谢了。/n山寺：指大林寺。始：才；刚刚。/n长恨：常常惋惜。春归：春天回去了。觅：寻找。/n不知：岂料，想不到。转：反。此中：这深山的寺庙里。/n参考资料：/n",
 *                 "extension_bad": "520",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "658",
 *                 "extension_content": "该诗只有短短的四句，从内容到语言都似乎没有什么深奥、奇警的地方，只不过是把“山高地深，时节绝晚” 、“与平地聚落不同”的景物节候，做了一番纪述和描写。但细读之，就会发现这首平淡自然的小诗，却写得意境深邃，富于情趣。/n诗的开首“人间四月芳菲尽，山寺桃花始盛开”两句，是写诗人登山时已届孟夏，正属大地春归，芳菲落尽的时候了。但不期在高山古寺之中，又遇上了意想不到的春景 —— 一片始盛的桃花。从紧跟后面的“长恨春归无觅处”一句可以得知，诗人在登临之前，就曾为春光的匆匆不驻而怨恨，而恼怒，而失望。因此当这始所未料的一片春景冲入眼帘时，该是使人感到多么的惊异和欣喜。诗中第一句的“芳菲尽”，与第二句的“始盛开” ，是在对比中遥相呼应的。它们字面上是纪事写景，实际上也是在写感情和思绪上的跳跃 —— 由一种愁绪满怀的叹逝之情，突变到惊异、欣喜，以至心花怒放。而且在首句开头，诗人着意用了“人间” 二字，这意味着这一奇遇、这一胜景，给诗人带来一种特殊的感受，即仿佛从人间的现实世界，突然步入到一个什么仙境，置身于非人间的另一世界。/n正是在这一感受的触发下，诗人想象的翅膀飞腾起来了。“长恨春归无觅处，不知转入此中来。” 诗人想到，自己曾因为惜春、恋春，以至怨恨春去的无情，但谁知却是错怪了春，原来春并未归去，只不过像小孩子跟人捉迷藏一样，偷偷地躲到这块地方来罢了。/n这首诗中，既用桃花代替抽象的春光，把春光写得具体可感，形象美丽；而且还把春光拟人化，把春光写得仿佛真是有脚似的，可以转来躲去。不，岂只是有脚而已，看它简直还具有顽皮惹人的性格呢。在这首短诗中，自然界的春光被描写得是如此的生动具体，天真可爱，活灵活现，如果没有对春的无限留恋、热爱，没有诗人的一片童心，是写不出来的。这首小诗的佳处，正在立意新颖，构思灵巧，而戏语雅趣，又复启人神思，惹人喜爱，可谓唐人绝句小诗中的又一珍品。/n人间四月芳菲尽， 山寺桃花始盛开。 长恨春归无觅处， 不知转入此中来。海拔越高，温度越低，所以季节的出现也较陆地晚这里就提出了一个问题：大林寺的桃花在季节上为什么比山下要开得迟？从气象的角度来解释，答案只有一个，这就是“受了气温垂直差异的影响。也就是说，大林寺桃花之所以开得迟，原因是由于这里是“山地气候” 的缘故。/n常识告诉我们，在山地地区，气温是随着地势的高度的上升而相应递减的。一般说， 高度每升高100米，气温就下降0.6℃。当山地垂直起伏到几干米时，气温的垂直差异就更为明显。加上植物对气温的适应能力不同，这样，处于不同高度地段的植物景观必然就会出现差异。庐山海拔高度约1 400米，山顶气温比山麓平川地区一般要低8～9℃；大林寺位于今日庐山“花径风景区”，比山下平原高出1 100余米，气温较山下的九江市一带低6～7℃；加以庐山地处长江与郡阳湖之间，江湖水汽郁结，云雾弥漫，日照不足，更使山上的气温降低，春天当然就来得迟了。/n对于这个道理，生活在一千多年前的白居易自然是无法理解的。这从他在《游大林寺序》中所写的一段话“大林穷远，山高地深，时节绝晚，于时孟夏(四月)，正如正、二月天，梨桃始花，人物风候，与平地聚落不同，初到恍然若别一世界者”，可以证明。 其实，气温垂直变化对植物的影响，不仅在庐山是这样，就是在别处也不例 外。试以喜马拉雅山在我国境内一段山地为例，位于山地东南谷地的察隅、墨脱一带，由于海拔较低，日照充足，气温较高，可以种植水稻、玉米、柑桔等喜高温作物；由此往上，到海拔3 000米处，气温下降、雨水减少，只能种青裸、小麦一类作物；再往上，则是草木稀疏的高山牧场；雪线以上则因终年积雪、气候恶劣，除了偶尔长着几棵雪莲以外，啥植物也长不了。可见，在山地地区，植物在垂直分布上的差异性是与山地气候要素一一气温和降水的垂直变异分不开的。所以山地地区的气候就表现出了“一山有四季，十里不同天”的特色了。▲/n参考资料：/n",
 *                 "extension_bad": "366",
 *                 "extension_title": "赏析"
 *             },
 *             {
 *                 "extension_good": "291",
 *                 "extension_content": "此诗作于唐宪宗元和十二年（817年）四月。白居易时任江州（今江西九江）司马，年四十六。/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "140",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "2164",
 *         "poem_title": "大林寺桃花",
 *         "poem_author": "白居易",
 *         "poem_tags": [
 *             "写景",
 *             "，",
 *             "写花",
 *             "，",
 *             "早教古诗100首"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4720",
 *         "poem_id": "3428370a0301",
 *         "poem_content": "  风雨端阳生晦冥，汨罗无处吊英灵。/n  海榴花发应相笑，无酒渊明亦独醒。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "71",
 *                 "extension_content": "参考资料：/n",
 *                 "extension_bad": "27",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "元代",
 *         "poem_praise_count": "2175",
 *         "poem_title": "已酉端午",
 *         "poem_author": "贝琼",
 *         "poem_tags": [
 *             "端午节",
 *             "，",
 *             "写花",
 *             "，",
 *             "抒怀",
 *             "，",
 *             "怀才不遇"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4721",
 *         "poem_id": "8d18260838e2",
 *         "poem_content": "  晨起动征铎，客行悲故乡。/n  鸡声茅店月，人迹板桥霜。/n  槲叶落山路，枳花明驿墙。(明驿墙 一作：照驿墙)/n  因思杜陵梦，凫雁满回塘。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "507",
 *                 "extension_content": "本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "227",
 *                 "extension_title": "创作背景"
 *             },
 *             {
 *                 "extension_good": "701",
 *                 "extension_content": "这首诗之所以为人们所传诵，是因为它通过鲜明的艺术形象，真切地反映了封建社会里一般旅人的某些共同感受。/n首句表现“早行”的典型情景，概括性很强。清晨起床，旅店里外已经响起了车马的铃铎声，旅客们套马、驾车之类的许多活动已暗含其中。第二句固然是作者讲自己，但也适用于一般旅客。“在家千日好，出外一时难。”在封建社会里，一般人由于交通困难、人情淡薄等许多原因，往往安土重迁，怯于远行。“客行悲故乡”这句诗，很能够引起读者情感上的共鸣。/n三、四两句，历来脍炙人口。宋代梅尧臣曾经对欧阳修说：最好的诗，应该“状难写之景如在目前，含不尽之意见于言外”。欧阳修请他举例说明，他便举出这两句和贾岛的“怪禽啼旷野，落日恐行人”，并反问道：“道路辛苦，羁旅愁思，岂不见于言外乎？”（《六一诗话》）明代李东阳进一步分析说：“二句中不用一二闲字，止提掇出紧关物色字样，而音韵铿锵，意象具足，始为难得。”“音韵铿锵”，“意象具足”，是一切好诗的必备条件。李东阳把这两点作为“不用一二闲字，止提掇紧关物色字样”的从属条件提出，很可以说明这两句诗的艺术特色。所谓“闲字”，指的是名词以外的各种词；所谓“提掇紧关物色字样”，指的是代表典型景物的名词的选择和组合。这两句诗可分解为代表十种景物的十个名词：鸡、声、茅、店、月、人、迹、板、桥、霜。虽然在诗句里，“鸡声”、“茅店”、“人迹”、“板桥”都结合为“定语加中心词”的“偏正词组”，但由于作定语的都是名词，所以仍然保留了名词的具体感。例如“鸡声”一词，“鸡”和“声”结合在一起，完全可以唤起引颈长鸣的视觉形象。“茅店”、“人迹”、“板桥”，也与此相类似。/n古时旅客为了安全，一般都是“未晚先投宿，鸡鸣早看天”。诗人既然写的是早行，那么鸡声和月是必然要体现的。而茅店又是山区有特征性的景物。“鸡声茅店月”，把旅人住在茅店里，听见鸡声就爬起来看天色，看见天上有月，就收拾行装，起身赶路的特征都有声有色地表现了出来。/n同样，对于早行者来说，板桥、霜和霜上的人迹也都是有特征性的景物。作者于雄鸡报晓、残月未落之时上路，也算得上“早行”了；然而已经是“人迹板桥霜”，这真是“莫道君行早，更有早行人”啊！这两句纯用名词组成的诗句，写早行情景宛然在目，确实称得上“意象具足”的佳句。/n“槲叶落山路，枳花明驿墙”两句，写的是刚上路的景色。商县、洛南一带，枳树、槲树很多。槲树的叶片很大，冬天虽干枯，却存留枝上；直到第二年早春树枝将发嫩芽的时候，才纷纷脱落。而这时候，枳树的白花已在开放。因为天还没有大亮，驿墙旁边的白色枳花，就比较显眼，所以用了个“明”字。可以看出，诗人始终没有忘记“早行”二字。/n旅途早行的景色，使诗人想起了昨夜在梦中出现的故乡景色：“凫雁满回塘。”春天来了，故乡杜陵，回塘水暖，凫雁自得其乐；而自己，却离家日远，在茅店里歇脚，在山路上奔波。“杜陵梦”，补出了夜间在茅店里思家的心情，与“客行悲故乡”首尾照应；而梦中的故乡景色与旅途上的景色又形成鲜明的对照。眼里看的是“槲叶落山路”，心里想的是“凫雁满回塘”。“早行”之景与情，都得到了完美的表现。▲/n参考资料：/n",
 *                 "extension_bad": "609",
 *                 "extension_title": "赏析"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "2186",
 *         "poem_title": "商山早行",
 *         "poem_author": "温庭筠",
 *         "poem_tags": [
 *             "初中古诗",
 *             "，",
 *             "写景",
 *             "，",
 *             "思乡"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4722",
 *         "poem_id": "58699ebb5e93",
 *         "poem_content": "  牧童骑黄牛，歌声振林樾。/n  意欲捕鸣蝉，忽然闭口立。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "1395",
 *                 "extension_content": "译文/n牧童骑在黄牛背上，嘹亮的歌声在林中回荡。/n忽然想要捕捉树上鸣叫的知了，就马上停止唱歌，一声不响地站立在树旁。/n注释/n牧童：指放牛的孩子。/n振：振荡；回荡。说明牧童的歌声嘹亮。/n林樾（yuè）：指道旁成阴的树。/n欲：想要。/n捕：捉。/n鸣：叫。/n立：站立。/n参考资料：/n",
 *                 "extension_bad": "435",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "1293",
 *                 "extension_content": "诗人在旅途的路上看见一个牧童骑着牛，唱着歌，忽然听到蝉的叫声，于是停住歌声跳下牛背，准备捕捉蝉。这一幕触发了诗人的诗兴，就写下了这一首“所见”。/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "852",
 *                 "extension_title": "创作背景"
 *             },
 *             {
 *                 "extension_good": "323",
 *                 "extension_content": "这首诗的第一句平平而起，不着痕迹。第二句调子突然高昂，旋律突然加快，从而形成一个高潮。一二句描写了小牧童的天真活泼、悠然自得的可爱模样和他的愉快心情，“骑”字直接写出了牧童的姿势，“振”字则间接点出他的心情。通过“骑”和“振”两个动词,把牧童那种悠闲自在、无忧无虑的心情和盘托了出来。他几乎完全陶醉在大自然的美景之中，简直不知道世间还有“忧愁”二字。正因为心中欢乐，才不禁引吭高歌，甚至于遏行云，“振林樾”。/n三四句仍然是继续描写神态。第三句是过渡，是作势。写牧童的心理活动，交代了他“闭口立”的原因，也是全诗的转折点。第四句，急转直下，如千尺悬瀑坠入深潭，戛然而止。“忽然”一词，把这个牧童发现树上鸣蝉时的惊喜心情和机警性格栩栩如生地表现了出来。“忽然”发生了变化：由响而静、由行而停，把小牧童闭口注目鸣蝉的瞬间神态写得韵味十足。而“闭”和“立”两个动词，则把这个牧童天真的神态和孩子式的机智刻划得淋漓尽致。全诗纯用白描手法，紧紧抓住小牧童一刹那间的表现，逼真地写出小牧童非常机灵的特点，让人倍觉小牧童的纯真可爱。/n这是一首反映儿童生活的诗篇，诗人在诗中赞美了小牧童充满童趣的生活画面。诗人先写小牧童的动态，那高坐牛背、大声唱歌的派头，何等散漫、放肆；后写小牧童的静态，那屏住呼吸，眼望鸣蝉的神情，显得特别专注。“此时无声胜有声”。这从动到静的变化，写得既突然又自然，把小牧童天真烂漫、好听多事的形象，刻画得活灵活现。这首诗正是在这种起伏变化中获得了巨大的艺术效果。诗的语言，明白如话，质朴无华，十分本色。至于下一步的动静，小牧童怎样捕蝉，捕到没有，诗人没有写，留给读者去体会、去遐想、去思考。/n这首诗通过对自然环境和社会生活的描写，直接抒发生活的感受，看似闲情逸致，实则寄托情思。同时这首诗不顾及格律，活泼自由，语言浅显明了，形象自然生动。综观全诗，它所描绘的和平、宁静和优美如画的田园风光，所刻划的活泼、自在和天真无邪的牧童形象，表现了诗人的一种“真性情”。诗人曾经说过 “诗人者，不失其赤子之心也。”毋庸讳言，诗所描绘、所刻划的，正是诗人毕生追求的境界，也正是他所一再强调的“真性情”。▲/n参考资料：/n",
 *                 "extension_bad": "225",
 *                 "extension_title": "赏析"
 *             }
 *         ],
 *         "poem_dynasty": "清代",
 *         "poem_praise_count": "2190",
 *         "poem_title": "所见",
 *         "poem_author": "袁枚",
 *         "poem_tags": [
 *             "古诗三百首",
 *             "，",
 *             "小学古诗",
 *             "，",
 *             "儿童",
 *             "，",
 *             "早教古诗100首"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4723",
 *         "poem_id": "5f6efd08156d",
 *         "poem_content": "  十五从军征，八十始得归。/n  道逢乡里人：“家中有阿谁？”/n  “遥看是君家，松柏冢累累。”(遥看 一作：遥望)/n  兔从狗窦入，雉从梁上飞。/n  中庭生旅谷，井上生旅葵。/n  舂谷持作饭，采葵持作羹。/n  羹饭一时熟，不知贻阿谁？/n  出门东向看，泪落沾我衣。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "4352",
 *                 "extension_content": "译文/n刚满十五岁的少年就出去打仗，到了八十岁才回来。/n路上碰到一个乡下的邻居，问：“我家里还有什么人？”/n（他说）“你家那个地方现在已是松树柏树林中的一片坟墓。”/n走到家门前看见野兔从狗洞里出进，野鸡在屋脊上飞来飞去。/n院子里长着野生的谷子，野生的葵菜环绕着井台。/n用捣掉壳的野谷来做饭，摘下葵叶来煮汤。/n汤和饭一会儿都做好了，却不知赠送给谁吃。/n走出大门向着东方张望，老泪纵横，洒落在征衣上。/n注：“遥望是君家，松柏冢累累。”原为“遥望是君家，松柏冢垒垒。”/n注释/n始：才。/n归：回家。/n道逢：在路上遇到。/n道：路途上。/n阿：语气词，没有意思。/n君：你，表示尊敬的称呼。/n遥望：远远地望去。/n松柏（bǎi）：松树、柏树。/n冢（zhǒng）：坟墓。/n累累：与“垒垒”通，形容丘坟一个连一个的样子。/n狗窦（gǒu dòu）：给狗出入的墙洞，窦，洞穴。/n雉（zhì）：野鸡。/n中庭：屋前的院子。/n生：长。/n旅：旅生，植物未经播种而野生。/n旅谷：野生的谷子。/n旅葵（kuí）：即野葵。/n舂（chōng）：把东西放在石臼或乳钵里捣掉谷子的皮壳或捣碎。/n持：用。/n作：当做。/n羹（gēng）：就是饭菜的意思。/n一时：一会儿就。/n贻（yí）：送，赠送。/n沾：渗入。▲/n参考资料：/n",
 *                 "extension_bad": "700",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "1317",
 *                 "extension_content": "这是一首叙事诗，描绘了一个“少小离家老大回”的老兵返乡途中与到家之后的情景，抒发了这一老兵的情感，也反映了当时的社会现实，具有一定的典型意义。开篇便不同凡响：“十五从军征，八十始得归。”这两句，直言老兵“十五”岁从军，“八十”岁方回，看似平淡无奇，像不经意间道来，实却耐人寻味，颇见功力。他“十五从军征”，奔赴何处，诗中未作说明；其军旅生活如何，战况怎样，诗中也均未交代。这就给读者留下众多想象的空间。但有一点是明确的，那就是他“从军征”，系出于战事，而且这一去就是数十年！“八十”与“十五”相对照，突出其“从军征”时间之久；“始得归”与“从军征”相呼应，则表明他中途一直未能回来。/n《十五从军征》，是一首暴露封建社会不合理的兵役制度的汉代乐府民歌，反映了劳动人民在当时黑暗的兵役制度下的不平和痛苦。作品真实、深刻、令人感愤，催人泣下。/n“道逢乡里人，‘家中有阿谁？’”主人公的思想脉络由六十五年的征战生活进入邈邈旷野、漫漫古道，对亲人家园的现状由茫然无际的想象到急切地、盼知又怕知地询问，读者由开头两句诗展开的遐想的翅翼也在主人公焦急的劈头问话声中收束。，一句“家中有阿谁”的追问，推出了作品的聚光点——家。六十五年了，岂敢奢望家人安然无恙、亲人健在？能有一二幸存者已是不幸中之万幸了。所以他只问，家中还有谁侥幸苟活人世呢？可是，“乡里人”的回答却如站在雪地里浇下的一盆冰水：“遥看是君家，松柏冢累累。”在这动乱的年月，我的亲人们竟无一幸存者？多少年来积压心底的感情，向谁倾诉、向谁表达啊？唯有那青青松柏、垒垒坟冢吗？那，就是我的家吗？不，不，不可能！/n摆在他面前的现实是：“兔从狗窦入，雉从梁上飞；中庭生旅谷，井上生旅葵。”由遥看到近见，满眼更加荒凉凄楚的景象。作者没说室空无人，而是抓住野兔见人钻进家畜窝中自以为得所，野鸡惊飞落到屋内梁上自以为安的情景；作者没有直书庭园荒芜杂乱，只摄取了井边、中庭随意生长的葵菜和谷物两个“镜头”，人去屋空，人亡园荒，更其形象，倍伤人心神。一个风尘仆仆的老人，站在曾经炊火融融、庭园整洁的“家”的面前，站在盼望了六十五年可又无一亲人相迎的家的面前，竟然比想象的还不堪十倍、百倍……这是怎样一种情境，将掀起读者怎样的感情波澜呢？/n“出门东向看，泪落沾我衣。”他走出年久失修的破门，向东方看去，他也许还抱着希望，他看到了谁？看到了什么呢？他也许看到了久别的亲人？也许什么也没有看到。他茫然地从幻想中走出来，低声哭了起来 “泪落沾我衣”五个字，饱和了多么丰富、多么深厚、多么沉痛的感情内涵啊！ 主人公和他的家的相互映衬的叙写，把作品的主题和艺术水平都推向了一个新的高度：服了整整六十五年兵役的人，竟然还是全家唯一的幸存者，那些没有服兵役的亲人们，坟上松柏都已葱葱郁郁，可以想见他们生前贫寒凄苦的生活还不如每时每刻都可能牺牲的士卒；作品具体写的是主人公为国征战六十五载却有家归不得，等到归时却又无家可归的不幸遭遇和惨痛心情，而他的不幸与那些苟生且不能只有走进静默、暗湿、冰冷的坟墓的亲人们相比，他又是“幸运者”了。作品就不仅仅暴露了封建兵役制度的黑暗、罪恶，不仅仅表现了八十老翁一人的不幸，而且反映了当时整个社会现实的黑暗，表现了比个人不幸更深广的全体人民的不幸和社会的凋敝、时代的动乱，/n诗的最后两句于对老兵的动作描绘中进一步抒发老兵心中的悲哀。这里，突出老兵出门张望（“出门东向看”）与老泪纵横（“泪落沾我衣”）这一细节，将举目无亲、孤身一人的老兵形象刻画得栩栩如生，将其悲痛欲绝的茫然之情抒发得淋漓尽致。试想，他“十五从军征，八十始得归”，家中已了无亲人，而只有荒凉的景象，怎能不悲从中来？以后的生活，又当如何呢？他又怎能不感到茫然呢？他向远方望去，难道自己的祖国里，只有自己一家是这样的吗？不是的。其悲惨的遭遇是谁造成的，尽管诗中未明言直说，但我们只要联系到此诗产生的时代背景，则不难看出这一点。根据吴兢《乐府古题要解》的说法，此诗晋时已谱入乐府，当可视之为汉魏战乱之际的作品。正是当时穷兵黩武的统治者与无休无止的战争，造成了该老兵的悲惨遭遇。反映该老兵的悲惨遭遇，也就反映了当时在沉重的徭役压迫之下的平民百姓的悲惨遭遇，深刻地揭露了当时黑暗的社会现实。/n此诗围绕老兵的返乡经历及其情感变化谋篇结构，巧妙自然。其返乡经历是：始得归→归途中→返回家中→“出门东向看”；情感变化为：急想回家，急想知道“家中有阿谁？”，充满与亲人团聚的希望（归途中）→希望落空→彻底失望（返回家中，景象荒凉，了无一人）→悲哀流泪，心茫然（“出门东向看”）。这些又归结为表现揭露黑暗社会现实的诗之主题。全诗运用白描手法绘景写人，层次分明，语言质朴，且以哀景写哀情，情真意切，颇具特色，也颇能体现汉乐府即景抒情的艺术特点。▲/n参考资料：/n",
 *                 "extension_bad": "375",
 *                 "extension_title": "鉴赏"
 *             },
 *             {
 *                 "extension_good": "931",
 *                 "extension_content": "《十五从军征》是一首揭露封建社会不合理的兵役制度的汉代乐府民歌，反映了劳动人民在当时黑暗的兵役制度下的不平和痛苦，作品真实、深刻、令人感愤，催人泣下。/n参考资料：/n",
 *                 "extension_bad": "356",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "两汉",
 *         "poem_praise_count": "2192",
 *         "poem_title": "十五从军征",
 *         "poem_author": "佚名",
 *         "poem_tags": [
 *             "古诗三百首",
 *             "，",
 *             "乐府",
 *             "，",
 *             "民歌",
 *             "，",
 *             "叙事",
 *             "，",
 *             "忧国忧民"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4724",
 *         "poem_id": "2d803c7ec16d",
 *         "poem_content": "  北风吹雪四更初，嘉瑞天教及岁除。/n  半盏屠苏犹未举，灯前小草写桃符。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "357",
 *                 "extension_content": "译文/n四更天初至时，北风带来一场大雪；这上天赐给我们的瑞雪正好在除夕之夜到来，兆示着来年的丰收。/n盛了半盏屠苏酒的杯子还没有来得及举起庆贺，我依旧在灯下用草字体赶写着迎春的桃符。/n注释/n嘉：好/n瑞：指瑞雪/n天教：天赐/n岁除：即除夕/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "183",
 *                 "extension_title": "译文及注释"
 *             }
 *         ],
 *         "poem_dynasty": "宋代",
 *         "poem_praise_count": "2220",
 *         "poem_title": "除夜雪",
 *         "poem_author": "陆游",
 *         "poem_tags": [
 *             "春节",
 *             "，",
 *             "写雪"
 *         ]
 *     }
 * ]
 * @apiVersion 1.0.0
 */
router.get('/:page',function(req, res){

	var query = {}
	
	responseAction("poem",query, req, res,parseInt(req.params.page), 6)
})


/**
 * @api {get} /poems/identifier/:poem_id 根据id查询诗词
 * @apiSampleRequest http://180.76.181.15:3000/poems/identifier/:poem_id
 * @apiDescription 根据id查询诗词
 * @apiName 根据id查询诗词
 * @apiGroup Poems
 * @apiParam {Int} poem_id 诗词的id
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4724",
 *         "poem_id": "2d803c7ec16d",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "357",
 *                 "extension_content": "译文/n四更天初至时，北风带来一场大雪；这上天赐给我们的瑞雪正好在除夕之夜到来，兆示着来年的丰收。/n盛了半盏屠苏酒的杯子还没有来得及举起庆贺，我依旧在灯下用草字体赶写着迎春的桃符。/n注释/n嘉：好/n瑞：指瑞雪/n天教：天赐/n岁除：即除夕/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "183",
 *                 "extension_title": "译文及注释"
 *             }
 *         ],
 *         "poem_dynasty": "宋代",
 *         "poem_praise_count": "2220",
 *         "poem_title": "除夜雪",
 *         "poem_author": "陆游",
 *         "poem_tags": [
 *             "春节",
 *             "，",
 *             "写雪"
 *         ]
 *     }
 * ]
 * @apiVersion 1.0.0
 */
router.get('/identifier/:poem_id',function(req, res){
	var query = {
		'poem_id' : req.params.poem_id
	}
	responseAction("poem",query, req,res, 0, 0)
})

/**
 * @api {get} /poems/name/:poem_title 根据题目名字查询诗词
 * @apiSampleRequest http://180.76.181.15:3000/poems/name/:poem_title
 * @apiDescription 根据题目名字查询诗词
 * @apiName 根据题目名字查询诗词
 * @apiGroup Poems
 * @apiParam {String} poem_title 诗词的题目
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4724",
 *         "poem_id": "2d803c7ec16d",
 *         "poem_content": "  北风吹雪四更初，嘉瑞天教及岁除。/n  半盏屠苏犹未举，灯前小草写桃符。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "357",
 *                 "extension_content": "译文/n四更天初至时，北风带来一场大雪；这上天赐给我们的瑞雪正好在除夕之夜到来，兆示着来年的丰收。/n盛了半盏屠苏酒的杯子还没有来得及举起庆贺，我依旧在灯下用草字体赶写着迎春的桃符。/n注释/n嘉：好/n瑞：指瑞雪/n天教：天赐/n岁除：即除夕/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "183",
 *                 "extension_title": "译文及注释"
 *             }
 *         ],
 *         "poem_dynasty": "宋代",
 *         "poem_praise_count": "2220",
 *         "poem_title": "除夜雪",
 *         "poem_author": "陆游",
 *         "poem_tags": [
 *             "春节",
 *             "，",
 *             "写雪"
 *         ]
 *     }
 * ]
 * @apiVersion 1.0.0
 */
router.get('/name/:poem_title',function(req, res){
	var query = {
		'poem_title' : req.params.poem_title
	}
	responseAction("poem",query, req, res,0, 0)
})


/**
 * @api {get} /poems/tag/:poem_tags/:page 根据朝tag查询诗词
 * @apiSampleRequest http://180.76.181.15:3000/poems/tag/:poem_tags/:page
 * @apiDescription 根据朝tag查询诗词
 * @apiName 根据朝tag查询诗词
 * @apiGroup Poems
 * @apiParam {String} poem_tags 诗词的tag
 * @apiParam {Int} page 页数
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c3aaa98b0dfadf4f46",
 *         "poem_id": "c27b959d054a",
 *         "poem_content": "  残霞夕照西湖好，花坞苹汀，十顷波平，野岸无人舟自横。 /n  西南月上浮云散，轩槛凉生。莲芰香清。水面风来酒面醒。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "53",
 *                 "extension_content": "译文/n西湖风光好，你看那夕阳映着晚霞的暮色，岸上的花坞，长满水草的小洲一片橙红。宽广的湖面波平似镜，小船横靠在那静寂无人的岸边。浮云消散，西南方露出了明月。傍水的栏杆边上凉风习习，带来了阵阵莲荷清香。这拂水的凉风，吹醒了游人的酒意。/n注释/n西湖：指颍州西湖。/n坞：湖岸凹入处。/n汀：水中洲。/n轩槛：长廊前木栏干。/n芰：即菱。/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "10",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "4",
 *                 "extension_content": "参考资料：/n",
 *                 "extension_bad": "2",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "宋代",
 *         "poem_praise_count": "54",
 *         "poem_title": "采桑子·残霞夕照西湖好",
 *         "poem_author": "欧阳修",
 *         "poem_tags": [
 *             "写景",
 *             "，",
 *             "夕阳",
 *             "，",
 *             "写水",
 *             "，",
 *             "西湖",
 *             "，",
 *             "抒情"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c3aaa98b0dfadf508e",
 *         "poem_id": "1e8758c47e25",
 *         "poem_content": "  何处？几叶萧萧雨。湿尽檐花，花底无人语。/n  掩屏山，玉炉寒。谁见两眉愁聚倚阑干。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "1",
 *                 "extension_content": "译文/n是什么时候，下起了浙浙沥沥的小雨？屋檐下的花朵都已被雨水打湿，然而花底下的人却默默无语。/n轻轻地将屏风掩紧，玉炉中所焚之香也已燃尽。谁能看到有个人正满含哀愁、深锁双眉，独自倚靠在栏杆边上。/n注释/n①玉连环影：词牌名，此调谱律不载，或亦自度曲。/n②何处：何时。古诗文中表示询问时间的用语。/n③檐（yán）花：屋檐之下的鲜花。/n④屏山：屏风，因屏风曲折若重山叠嶂，或屏风上绘有山水图画等而得名。/n⑤阑干：同“栏干”。/n参考资料：/n",
 *                 "extension_bad": "0",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "1",
 *                 "extension_content": "参考资料：/n",
 *                 "extension_bad": "0",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "清代",
 *         "poem_praise_count": "12",
 *         "poem_title": "玉连环影·何处",
 *         "poem_author": "纳兰性德",
 *         "poem_tags": [
 *             "写景",
 *             "，",
 *             "抒情",
 *             "，",
 *             "怀人"
 *         ]
 *     },
 *     .
 *     .
 *     .
 * ]
 *
 * @apiVersion 1.0.0
 */
router.get('/tag/:poem_tags/:page',function(req, res){
	var query = {
		'poem_tags' : {
			'$in' : [
				req.params.poem_tags
			]
		}
	}
	responseAction("poem",query, req, res, parseInt(req.params.page),6)
})




/**
 * @api {get} /poems/author/:poem_author/:page 根据朝作者查询诗词
 * @apiSampleRequest http://180.76.181.15:3000/poems/author/:poem_author/:page
 * @apiDescription 根据朝作者查询诗词
 * @apiName 根据朝作者查询诗词
 * @apiGroup Poems
 * @apiParam {String} poem_author 诗词的作者
 * @apiParam {Int} page 页数
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4a3c",
 *         "poem_id": "4d3b4d132c82",
 *         "poem_content": "  有耳莫洗颍川水，有口莫食首阳蕨。/n  含光混世贵无名，何用孤高比云月？/n  吾观自古贤达人，功成不退皆殒身。/n  子胥既弃吴江上，屈原终投湘水滨。/n  陆机雄才岂自保？李斯税驾苦不早。/n  华亭鹤唳讵可闻？上蔡苍鹰何足道？/n  君不见吴中张翰称达生，秋风忽忆江东行。/n  且乐生前一杯酒，何须身后千载名？",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "72",
 *                 "extension_content": "本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "25",
 *                 "extension_title": "创作背景"
 *             },
 *             {
 *                 "extension_good": "74",
 *                 "extension_content": "本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "54",
 *                 "extension_title": "鉴赏"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "256",
 *         "poem_title": "行路难·其三",
 *         "poem_author": "李白",
 *         "poem_tags": [
 *             "唐诗三百首",
 *             "，",
 *             "乐府",
 *             "，",
 *             "人生",
 *             "，",
 *             "态度"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c3aaa98b0dfadf4a45",
 *         "poem_id": "edfc02db5bb3",
 *         "poem_content": "  日色欲尽花含烟，月明欲素愁不眠。(欲素 一作：如素)/n  赵瑟初停凤凰柱，蜀琴欲奏鸳鸯弦。/n  此曲有意无人传，愿随春风寄燕然。/n  忆君迢迢隔青天，昔日横波目，今作流泪泉。/n  不信妾断肠，归来看取明镜前。(断肠 一作：肠断)",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "115",
 *                 "extension_content": "韵译/n夕阳西下暮色朦胧，花蕊笼罩轻烟，/n月华如练，我思念着情郎终夜不眠。/n柱上雕饰凤凰的赵瑟，我刚刚停奏，/n心想再弹奏蜀琴，又怕触动鸳鸯弦。/n这饱含情意的曲调，可惜无人传递，/n但愿它随着春风，送到遥远的燕然。/n忆情郎呵、情郎他迢迢隔在天那边，/n当年递送秋波的双眼，/n而今成了流泪的源泉。/n您若不信贱妾怀思肝肠欲断，/n请归来看看明镜前我的容颜！/n注释/n赵瑟：相传古代赵国的人善弹瑟。瑟：弦乐器。/n凤凰柱：或是瑟柱上雕饰凤凰形状。/n蜀琴句：旧注谓蜀琴与司马相如琴挑故事有关。按：鲍照有“蜀琴抽白雪”句。白居易也有“蜀琴安膝上，《周易》在床头”句。李贺“吴丝蜀桐张高秋”，王琦注云：“蜀中桐木宜为乐器，故曰蜀桐。”蜀桐实即蜀琴。似古人诗中常以蜀琴喻佳琴，恐与司马相如、卓文君事无关。鸳鸯弦也只是为了强对凤凰柱。▲/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "22",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "97",
 *                 "extension_content": "“日色欲尽花含烟，月明如素愁不眠”一句，季节、时间、环境、情绪全出来了。春日的一个黄昏，日色将尽，夜幕降临，花辨上也似乎含着缕缕烟雾，女主人在干什么呢？月亮已经升起来了，明如镜、皎如绢，一种淡淡的愁绪让她开始感到闷倦，难以安眠。这样一烘托，一幅温婉细腻的场景率先浮现在了读者面前。/n紧接着一副工整的对仗“赵瑟初停凤凰柱，蜀琴欲奏鸳鸯弦”。古代赵国的妇女善鼓瑟，故称赵瑟，蜀中有桐木宜作琴，相传司马相如曾奏蜀琴来挑逗卓文君。诗人用这两句排比在暗喻什么呢。从字面上来看，赵瑟刚弹过，凤凰状的瑟柱停下来了，又不知不觉的拿起蜀琴，准备开始奏起鸳鸯弦。而凤凰、鸳鸯都是成双成对生活，正是男女之情的一种见证！哦，原来女主人是在思念她的爱人了。/n再来看下句“此曲有意无人传，愿随春风寄燕然”，男人在思念至极呐喊“天长地远魂飞苦，梦魂不到关山难”，一片如火之热情。女人则如水，她不怨恨，她只是把满怀心事托与春风，希望春风能把因凤凰柱、鸳鸯弦带给她的那深切的别离之苦捎给远方的心上人。“寄燕然”一句告诉我们，原来她的丈夫是从征去了。李白在《关山月》中曾经这样描写过征客的心境“戍客望边邑，思归多苦颜。高楼当此夜，叹息未应闲”，这样的思念，比起“一种相思、两种闲愁”的“闲愁”更多了几分烟火气息和现实意义。/n心事已经寄予春风了，春风真的能给爱人带去自己的一片相思吗？女人心里依旧一片茫然，于是她发出了一声沉重的叹息：“忆君迢迢隔青天”！山水迢迢，对你的思念如此遥远，就象隔着那苍茫的青天。/n“昔日横波目，今为流泪泉”，一句想象奇特、大胆夸张的对偶把这个美丽的女子形象刻画出来了，旧日的那对顾盼灵秀、眼波如流的双目，如今却变成了泪水的源泉，可知二人分开之后，女子除了长夜无眠和深深叹息之外，竟是常常的以泪洗面。/n末句“不信妾肠断，归来看取明镜前”，使这个女子的形象更加鲜明丰满了，你看她娇嗔的说道：如果你不相信我因为思念你而肝肠寸断，等你回来时，在明镜前看看我憔悴、疲惫的面容就知道了。一副天真、调皮的样子跃然纸上，让人倍加爱怜和心痛。/n《长相思》第二首相比第一首，言语更加浅显易懂、音韵更加曲调化，我想，这与唐朝音乐鼎盛有关，从宫廷乐府到民间教坊，许多诗词都被谱上曲谱，四处吟唱，李白的乐府诗更是其中一颗璀璨的明珠。第二首又用了夸张、排比、想象、暗喻等手法，从多个角度把这个美丽多情的女子对出征边塞丈夫的思念之情表现得淋漓尽致。/n诗人虽不是女子，却能刻画如此生动、细腻的女子形象，就好像曹雪芹不是女人，却能读懂天下形形色色的女人一样，我想，世间无论男女，也许不必太多的在意付出，只要能真正的读懂对方，此生足矣！▲/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "19",
 *                 "extension_title": "简析"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "259",
 *         "poem_title": "长相思·其二",
 *         "poem_author": "李白",
 *         "poem_tags": [
 *             "唐诗三百首",
 *             "，",
 *             "乐府",
 *             "，",
 *             "女子",
 *             "，",
 *             "思念"
 *         ]
 *     },
 *     .
 *     .
 *     .
 * ]
 * @apiVersion 1.0.0
 */
router.get('/author/:poem_author/:page',function(req, res){
	var query = {
		'poem_author' : req.params.poem_author
	}
	responseAction("poem",query, req, res,parseInt(req.params.page), 6)
})


/**
 * @api {get} /poems/dynasty/:poem_dynasty/:page 根据朝代查询诗词
 * @apiSampleRequest http://180.76.181.15:3000/poems/dynasty/:poem_dynasty/:page
 * @apiDescription 根据朝代查询诗词
 * @apiName 根据朝代查询诗词
 * @apiGroup Poems
 * @apiParam {String} poem_dynasty 诗词所在的朝代
 * @apiParam {Int} page 页数
 * @apiSuccessExample {json} Success-Response:
 * [
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf4839",
 *         "poem_id": "b4fbe7244670",
 *         "poem_content": "  多情却似总无情，唯觉樽前笑不成。/n  蜡烛有心还惜别，替人垂泪到天明。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "234",
 *                 "extension_content": "韵译/n聚首如胶似漆作别却象无情；/n只觉得酒筵上要笑笑不出声。/n案头蜡烛有心它还依依惜别；/n你看它替我们流泪流到天明。/n注释/n多情句：意谓多情者满腔情绪，一时无法表达，只能无言相对，倒象彼此无情。/n樽：酒杯。/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "153",
 *                 "extension_title": "译文及注释"
 *             },
 *             {
 *                 "extension_good": "153",
 *                 "extension_content": "这一首着重写惜别，描绘与她的筵席上难分难舍的情怀。首名写离筵之上压抑无语，似乎冷淡无情；次句以“笑不成”点明原非无情，而是郁悒感伤，实乃多情，回应首句。/n齐、梁之间的江淹曾经把离别的感情概括为“黯然销魂”四字。但这种感情的表现，却因人因事的不同而千差万别，这种感情本身，也不是“悲”、“愁”二字所能了得。杜牧此诗不用“悲”、“愁”等字，却写得坦率、真挚，道出了离别时的真情实感。/n诗人同所爱不忍分别，又不得不分别，感情是千头万绪的。“多情却似总无情”，明明多情，偏从“无情”着笔，著一“总”字，又加强了语气，带有浓厚的感情色彩。诗人爱得太深、太多情，以至使他觉得，无论用怎样的方法，都不足以表现出内心的多情。别筵上，凄然相对，象是彼此无情似的。越是多情，越显得无情，这种情人离别时最真切的感受，诗人把它写出来了。“唯觉樽前笑不成”，要写离别的悲苦，他又从“笑”字入手。一个“唯”字表明，诗人是多么想面对情人，举樽道别，强颜欢笑，使所爱欢欣！但因为感伤离别，却挤不出一丝笑容来。想笑是由于“多情”，“笑不成”是由于太多情，不忍离别而事与愿违。这种看似矛盾的情态描写，把诗人内心的真实感受，说得委婉尽致，极有情味。/n题为“赠别”，当然是要表现人的惜别之情。然而诗人又撇开自己，去写告别宴上那燃烧的蜡烛，借物抒情。诗人带着极度感伤的心情去看周围的世界，于是眼中的一切也就都带上了感伤色彩。这就是刘勰所说的：“属采附声，亦与心而徘徊”（《文心雕龙·物色》）。“蜡烛”本是有烛芯的，所以说“蜡烛有心”；而在诗人的眼里烛芯却变成了“惜别”之心，把蜡烛拟人化了。在诗人的眼里，它那彻夜流溢的烛泪，就是在为男女主人的离别而伤心了。“替人垂泪到天明”，“替人”二字，使意思更深一层。“到天明”又点出了告别宴饮时间之长，这也是诗人不忍分离的一种表现。/n诗人用精炼流畅、清爽俊逸的语言，表达了悱恻缠绵的情思，风流蕴藉，意境深远，余韵不尽。就诗而论，表现的感情还是很深沉、很真挚的。杜牧为人刚直有节，敢论列大事，却也不拘小节，好歌舞，风情颇张，本诗亦可见此意。▲/n本节内容整理自网络（或由匿名网友上传），原作者已无法考证，版权归原作者所有。本站免费发布仅供学习参考，其观点不代表本站立场。站务邮箱：service@gushiwen.org/n",
 *                 "extension_bad": "50",
 *                 "extension_title": "鉴赏"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "727",
 *         "poem_title": "赠别",
 *         "poem_author": "杜牧",
 *         "poem_tags": [
 *             "唐诗三百首",
 *             "，",
 *             "离别",
 *             "，",
 *             "惜别"
 *         ]
 *     },
 *     {
 *         "_id": "5b9b55c2aaa98b0dfadf483b",
 *         "poem_id": "347c0617ef39",
 *         "poem_content": "  寒雨连江夜入吴，平明送客楚山孤。(连江 一作：连天)/n  洛阳亲友如相问，一片冰心在玉壶。/n  丹阳城南秋海阴，丹阳城北楚云深。/n  高楼送客不能醉，寂寂寒江明月心。",
 *         "poem_extension": [
 *             {
 *                 "extension_good": "49",
 *                 "extension_content": "这两首诗所记送别的时间和情景是“倒叙”。第一首写的是第二天早晨在江边送别友人的情景；第二首写第一天晚上在芙蓉楼为友人饯行之事。/n第一首写平明送客，临别托意。”寒雨连江夜入吴”，迷蒙的烟雨笼罩着吴地江天（江宁一带，此地是三国孙吴故地），织成了一张无边无际的愁网。夜雨增添了萧瑟的秋意，也渲染出了离别的黯淡气氛。那寒意不仅弥漫在满江烟雨之中，更沁透在两个离别友人的心头上。”连”字和”入”字写出雨势的平稳连绵，江雨悄然而来的动态能为人分明地感知，则诗人因离情萦怀而一夜未眠的情景也自可想见。 但是，这一幅水天相连、浩渺迷茫的吴江夜雨图，正好展现了一种极其高远壮阔的境界。中晚唐诗和婉约派宋词往往将雨声写在窗下梧桐、檐前铁马、池中残荷等等琐物上，而王昌龄却并不实写如何感知秋雨来临的细节，他只是将听觉、视觉和想象概括成连江入吴的雨势，以大片淡墨染出满纸烟雨，这就用浩大的气魄烘托了”平明送客楚山孤”的开阔意境。清晨，天色已明，辛渐即将登舟北归。诗人遥望江北的远山，想到友人不久便将隐没在楚山之外，孤寂之感油然而生。在辽阔的江面上，进入诗人视野的当然不止是孤峙的楚山，浩荡的江水本来是最易引起别情似水的联想的，唐人由此而得到的名句也多得不可胜数。 然而王昌龄没有将别愁寄予随友人远去的江水，却将离情凝注在矗立于苍莽平野的楚山之上。因为友人回到洛阳，即可与亲友相聚，而留在吴地的诗人，却只能像这孤零零的楚山一样，伫立在江畔空望着流水逝去。一个”孤”字如同感情的引线，自然而然牵出了后两句临别叮咛之辞：”洛阳亲友如相问，一片冰心在玉壶。”诗人从清澈无瑕、澄空见底的玉壶中捧出一颗晶亮纯洁的冰心以告慰友人，这就比任何相思的言辞都更能表达他对洛阳亲友的深情。/n早在六朝刘宋时期，诗人鲍照就用”清如玉壶冰”《代白头吟》来比喻高洁清白的品格。自从开元宰相姚崇作《冰壶诫》以来，盛唐诗人如王维、崔颢、李白等都曾以冰壶自励，推崇光明磊落、表里澄澈的品格。王昌龄托辛渐给洛阳亲友带去的口信不是通常的平安竹报，而是传达自己依然冰清玉洁、坚持操守的信念，是大有深意的。/n诗人在这以晶莹透明的冰心玉壶自喻，正是基于他与洛阳诗友亲朋之间的真正了解和信任，这决不是洗刷谗名的表白，而是蔑视谤议的自誉。因此诗人从清澈无瑕、澄空见底的玉壶中捧出一颗晶亮纯洁的冰心以告慰友人，这就比任何相思的言辞都更能表达他对洛阳亲友的深情。/n即景生情，情蕴景中，本是盛唐诗的共同特点，而深厚有余、优柔舒缓。“尽谢炉锤之迹”（胡应麟《诗薮》）又是王诗的独特风格。此诗那苍茫的江雨和孤峙的楚山，不仅烘托出诗人送别时的凄寒孤寂之情，更展现了诗人开朗的胸怀和坚强的性格。屹立在江天之中的孤山与冰心置于玉壶的比象之间又形成一种有意无意的照应，令人自然联想到诗人孤介傲岸、冰清玉洁的形象，使精巧的构思和深婉的用意融化在一片清空明澈的意境之中，所以天然浑成，不着痕迹，含蓄蕴藉，余韵无穷。/n第二首说的是头天晚上诗人在芙蓉楼为辛渐饯别时的情景。先从“秋海阴”、“楚雪深”写起，以景起兴。第三句是点题：高楼送客，依依惜别，心情悲愁，酒不尽兴。末句以景结情：寒江寂寂，惆怅如不尽之江水；明月高照，友情像明月一样地纯真。全诗融情入景，以景结情，主要还是抒情，堪称一绝。▲/n参考资料：/n",
 *                 "extension_bad": "18",
 *                 "extension_title": "赏析"
 *             },
 *             {
 *                 "extension_good": "49",
 *                 "extension_content": "参考资料：/n",
 *                 "extension_bad": "32",
 *                 "extension_title": "创作背景"
 *             }
 *         ],
 *         "poem_dynasty": "唐代",
 *         "poem_praise_count": "726",
 *         "poem_title": "芙蓉楼送辛渐二首",
 *         "poem_author": "王昌龄",
 *         "poem_tags": [
 *             "组诗",
 *             "，",
 *             "送别",
 *             "，",
 *             "友情",
 *             "，",
 *             "写景",
 *             "，",
 *             "抒情"
 *         ]
 *     },
 *     .
 *     .
 *     .
 * ]
 *
 * @apiVersion 1.0.0
 */
router.get('/dynasty/:poem_dynasty/:page',function(req, res){
	var query = {
		'poem_dynasty' : req.params.poem_dynasty
	}
	
	responseAction("poem",query, req, res, parseInt(req.params.page),6)
})

module.exports = router









